[
    {
      "title": "Django: Python Web Development Unleashed",
      "author": "Educative",
      "free": true,
      "overview": "Django is a free and open-source web application framework written in Python. It is used for rapid web development and clean, pragmatic design. It is built by experienced developers to make repetitive tasks easier, so you can focus on writing apps instead of reinventing the wheel. This course teaches Django for beginning and intermediate level learners. The course includes a hands-on learning experience with the help of interactive widgets. At the end of the course, you will have created a project in Django that can be used in your portfolio.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/10370001/5026411048861696/image/4604108341248000",
      "url": "https://www.educative.io/courses/django-python-web-development"
    },
    {
      "title": "Advanced React Patterns With Hooks",
      "author": "Ohans Emmanuel",
      "free": false,
      "overview": "With the release of hooks, certain React patterns have gone out of style. Hooks are likely the way we’ll be writing React components for the next couple of years, so they are quite important. React patterns can still be used, but in most cases, developers will be better off using hooks. For example, they should choose hooks over render props or higher-order components. There may be specific cases where the aforementioned could still be used, but most of the time, hooks are better. That being said, this course will teach you some of the more advanced React patterns implemented with hooks.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/5854561945255936/5664668925296640/image/6581287687553024",
      "url": "https://www.educative.io/courses/advanced-react-patterns-with-hooks"
    },
    {
      "title": "Web Development: Unraveling HTML, CSS, and JavaScript",
      "author": "Istvan Novak",
      "free": false,
      "overview": "HTML, CSS, and JavaScript: The trinity of web development technologies. If you’re looking to get ramped up on front-end development, this course is for you. You'll find it particularly useful if you're coming from some other area of software development, although prior experience is not required. In this course, you will start with a short tour of HTML, CSS, and JS. You’ll get to experiment with them through examples that explain their role and behavior. From there, you will then dive deep into each technology, exploring concepts like forms and controls in HTML, OOP in JavaScript, and the most important CSS patterns to make your web pages look good. By the end of this course, you will be able to make your own web applications that are responsive, stylized, and performant.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/10370001/5551624074297344/image/5668113229021184",
      "url": "https://www.educative.io/courses/web-development-unraveling-html-css-js"
    },
    {
      "title": "Building Full-Stack Web Applications with AdonisJs",
      "author": "Champ Ramentio",
      "free": true,
      "overview": "This course is a detailed guide to AdonisJs. AdonisJs, inspired by Laravel, is a Node.js framework that allows developers to build full-stack web applications and micro-API servers. In this course, you will cover the fundamentals: routes, controllers, middleware, hooks, and more. Each chapter contains code examples and illustrations to enhance your learning, and you will also be able to quiz yourself on the materials covered. By the time you are done with the course, you'll have plenty of hands-on practice, and will be able to confidently write your full-stack applications in AdonisJs.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/10370001/6079504494624768/image/6402210052177920",
      "url": "https://www.educative.io/courses/building-full-stack-web-applications-adonisjs"
    },
    {
      "title": "Using TypeScript with React",
      "author": "Carl Rippon",
      "free": true,
      "overview": "If you are a React developer and want to build your React apps faster and more robustly, this course is for you. Learn to integrate TypeScript with React, boost your productivity, and create apps that are easier to maintain. In this course, you will learn how to utilize TypeScript’s sophisticated type system to make React development faster and your code more readable. You will learn how to create component props, state, and events that are strongly-typed, allowing you to quickly understand what you can pass and helping you avoid mistakes. Lastly, you will set up React projects with TypeScript. First, you will learn how to do this with the Create React App tool, then how to create a React and TypeScript project with Webpack and Babel.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/4619705736232960/4884662000287744/image/6150106001702912",
      "url": "https://www.educative.io/courses/using-typescript-with-react"
    },
    {
      "title": "Web Application and Software Architecture 101",
      "author": "Shivang Sarawagi",
      "free": false,
      "overview": "This course is a 101 on web application and software architecture. It walks you step by step through the different components and concepts involved in designing the architecture of a web application. You'll learn about various architectural styles such as the client-server, peer to peer decentralized architecture, microservices, the fundamentals of data flow in a web application, the different layers that are involved, concepts like scalability and high availability, and much more. In this course, we'll also go through the techniques of picking the right architecture and the technology stack to implement our use case. I'll walk you through different use cases which will help you gain an insight into what technology and architecture best fit a certain use case when writing a web application. You’ll come to understand the technology trade-offs involved.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/6064040858091520/6411938009448448/image/6389694217584640",
      "url": "https://www.educative.io/courses/web-application-software-architecture-101"
    },
    {
      "title": "Advanced TypeScript Masterclass",
      "author": "Milosz Piechocki",
      "free": false,
      "overview": "Are you using TypeScript, but feel like you’re not making the most out of it? Do you find some advanced TypeScript concepts confusing? Do you get lost looking at complex type errors? If you answered “yes” to any of these questions, then this course is for you! It introduces you to the world of advanced TypeScript concepts including: compiler flags for catching more errors, generic types, and how to compose types with discriminated unions. After finishing this course, you’ll feel more confident in your TypeScript skills. You will be able to write types that detect whole classes of possible runtime errors at compile time. Typing even the most untypeable JavaScript code will be a no brainer for you, and you’ll be fluent in TypeScript error messages.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/4801358654865408/6710354043207680/image/4896926832001024",
      "url": "https://www.educative.io/courses/advanced-typescript-masterclass"
    },
    {
      "title": "A Hands-on Guide to Angular",
      "author": "Nishu Goel",
      "free": true,
      "overview": "In this course, you will cover the most fundamental concepts of Angular, a popular JavaScript framework. You will learn everything about building a complete Angular app, setting up the development environment, and building your own single-page application (SPA). You’ll start off by covering the basic building blocks of Angular such as modules, components, and directives. After that, the course will introduce you to some more advanced material that focuses on forms, routing, and dealing with APIs. By the end of this course, you will have gained hands-on experience by building a fully functional e-commerce application.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/5854561945255936/5664668925296640/image/6581287687553024",
      "url": "https://www.educative.io/courses/a-hands-on-guide-to-angular"
    },
  
    {
      "title": "Test-driven Development with React",
      "author": "The Pragmatic Programmers",
      "free": false,
      "overview": "This course is a deep dive into testing in React. You will learn unit testing and integration testing using tools such as Jest and Enzyme. You will also learn about other tools such as ESlint, Prettier, Babel, Webpack, and Travis CI that add convenience for coding and testing.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/10370001/4635489064189952/image/5070397269082112",
      "url": "https://www.educative.io/courses/test-driven-react-development"
    },
    {
      "title": "Developing Mobile Apps with Ionic and React",
      "author": "Michael D. Callaghan",
      "free": false,
      "overview": "The Ionic Framework is an open-source SDK for hybrid mobile app development. It’s known for providing platform-specific UI elements through a library of native components for iOS and Android. In this course, you will cover all the most important aspects of development with Ionic and React. Throughout, you will work to build a fully functional attendance application which you can add to your portfolio. By the end, you will have the confidence and the means to create and deploy your own mobile app for iOS or Android.",
      "img": "https://www.educative.io/cdn-cgi/image/f=auto,fit=cover,w=600/v2api/collection/10370001/5481733085462528/image/6094141386129408",
      "url": "http://www.google.com/"
    }
  ]  